run/tutorials/incompressible/overSimpleFoam/aeroFoil/background_overset/system/postProcessingDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      postProcessingDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    processorField1
    {
        // Mandatory entries
        type            processorField;
        libs            (fieldFunctionObjects);

        // Optional (inherited) entries
        result          procField;
        region          region0;
        enabled         true;
        log             true;
        timeStart       0;
        timeEnd         5000;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   -1;
    }
}


// ************************************************************************* //
